Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/civil_partnerships/how_civil_partnership_changes_your_legal_status.html.txt.tmx
Source language: en
Languages: ga

source: How civil partnership changes your legal status
ga: An chaoi a n-athraíonn páirtnéireacht shibhialta do stádas dlíthiúil

source: Civil partnership is a legally binding civil contract and gives rise to many far-reaching legal consequences which are generally similar to the legal consequences of getting married
ga: Conradh atá ina cheanglas dlíthiúil is ea páirtnéireacht shibhialta agus bíonn sí ina húdar le go leor iarmhairtí fadiarmhartacha dlíthiúla atá cosúil leis na hiarmhairtí a bhaineann le pósadh, den chuid is mó

source: Civil partnership changes your entitlements and obligations regarding:
ga: Athraíonn páirtnéireacht shibhialta do theidlíochtaí agus d’oibleagáidí i ndáil le:

source: • Life insurance and pensions
ga: • Árachas Saoil agus Pinsin

source: • Barring, Safety and Protection Orders
ga: • Orduithe Urchoisc, Sábháilteachta agus Cosanta

source: Other consequences of civil partnership
ga: Cúinsí eile de pháirtnéireacht shibhialta

source: Civil liability: a surviving civil partner may sue in respect of the wrongful death of their civil partner, where the death was caused by the negligence or wrongdoing of another person and has resulted in injury or mental distress to the survivor
ga: Dliteanas sibhialta: d’fhéadfaí go bhfuil páirtnéir sibhialta in ann agair mar gheall ar bhás éagórach a p(h)áirtnéir sibhialta, áit ar chúis a b(h)áis neamart nó éagóir dhuine eile agus a raibh gortú nó anbhuain meabhrach ar an marthanóir mar thoradh air

source: Mental health: a civil partner may apply for the involuntary admission to a psychiatric institution of a mentally ill civil partner (provided the parties are not separated and provided the applicant has not been the subject of an application under the Domestic Violence Acts)
ga: Meabhairshláinte: is féidir le páirtnéir sibhialta cur isteach ar iontráil ainneonach chuig institiúid shiciatrach do pháirtnéir sibhialta a bhfuil galar intinne air (ar choinníoll nach bhfuil na páirtithe scartha agus ar choinníoll nach bhfuil sé ina ábhár d’iarratas faoi na hAchtanna um Fhoréigin Baile)

source: Power of attorney: a civil partner must be informed of the registration of an enduring power of attorney
ga: Cumhacht aturnae: caithfear páirtnéir sibhialta a bheith curtha ar an eolas faoi chlárú cumhacht aturnae seasmhach

source: Similarly, an enduring power of attorney in favour of a civil partner ceases to be valid if the partnership is dissolved or there is a safety or barring order against the civil partner
ga: Ar an gcaoi chéanna, scoirtear bailíocht chumhacht aturnae seasmach i bhfábhar pháirtnéir sibhialta má dhíscaoiltear an pháirtnéireacht nó tá ordú sábháilteachta nó urchoisc in aghaidh an pháirtnéir sibhialta

source: Property disputes: a civil partner may apply to the courts for a decision in relation to disputes over property with his/her partner
ga: Aighnis réadmhaoine: féadfaidh páirtnéir sibhialta cur isteach chuig na cúirteanna do chinneadh i ndáil le haighnis faoi réadmhaoin idir é agus a p(h)áirtnéir

source: Tenancies: Under the Residential Tenancies Act 2004 a civil partner may be able to take over a tenancy on the death of their partner
ga: Tionóntachtaí: Faoin Acht Tionóntachtaí Cónaitheacha 2004 féadfaidh páirtnéir sibhialta teacht i gcomharbacht ar thionóntacht ar bhás a p(h)áirtnéara

source: Former spouses who entered into civil partnerships
ga: Iar-chéilí a d’iontráil i bpáirtnéireachtaí sibhialta

source: Former spouses who entered into civil partnerships effectively lost their status as former spouses
ga: Chaill iar-chéilí a d’iontráil i bpáirtnéireachtaí sibhialta a stádas mar iar-chéilí, go héifeachtach

source: Under divorce legislation, former spouses continue to have the right to apply to the courts for maintenance and property orders
ga: Faoin reachtaíocht cholscartha, tá an ceart ag iar-chéilí chun iarratas a dhéanamh ar na cúirteanna ar orduithe cothabhála agus maoine

source: However, once they entered into a civil partnership, this changed
ga: A luaithe a d’iontráil siad i bpáirtnéireacht shibhialta, áfach, tháinig athrú air seo

source: Maintenance orders and pension adjustment orders in favour of a former spouse lapsed if that spouse entered into a civil partnership
ga: Chuaigh orduithe cothabhála agus orduithe coigeartaithe pinsin i bhfabhar iar-chéile as feidhm má d'iontráil an chéile sin i bpáirtéireacht shibhialta

source: A property adjustment order may not be made for the benefit of a former spouse if that spouse has registered in a civil partnership
ga: Ní féidir ordú coigeartaithe maoine a dhéanamh ar mhaithe le hiar-chéile má chláraigh an céile sin i bpáirtnéireacht shibhialta
